# 11-join-table
> Join the datasets into one mega table.

In [ ]:
# import packages
import pandas as pd
import janitor
import numpy as np
from sklearn.model_selection import train_test_split
# must install janitor package with the following shell command:
# 'conda install -c conda-forge pyjanitor'

In [ ]:
# mount google drive
from google.colab import drive
drive.mount('/content/gdrive')
     
# navigate to directory
%cd /content/gdrive/MyDrive/Projects/repeat_customers

In [ ]:
# read data files and clean names
individual_sample = pd.read_csv('sample_data/individual_sample.csv', sep = ',', skiprows=[1]).clean_names()
product = pd.read_csv('sample_data/product.csv', sep = '|', skiprows=[1]).clean_names()
sales_sample = pd.read_csv('sample_data/sales_data_sample.csv', sep = ',', skiprows=[1]).clean_names()
store = pd.read_csv('sample_data/store.csv', sep = '|', skiprows=[1]).clean_names()
vehicle_sample = pd.read_csv('sample_data/vehicle_sample.csv', sep = ',', skiprows=[1]).clean_names()

In [ ]:
# convert store zip and id to string
store['store_id']= store['store_id'].apply(str)
sales_sample['store_id']= sales_sample['store_id'].apply(str)
store['zip_code']= store['zip_code'].apply(str)

In [ ]:
# change the column name of table 'individual'
individual_sample = individual_sample.rename(columns = {'mzb_indiv_id':'indiv_id'})

In [ ]:
mega_table = sales_sample.merge(product, on = 'article_id', how = 'left')
mega_table = mega_table.merge(store, on = 'store_id', how = 'left')
mega_table = mega_table.merge(individual_sample, on = 'indiv_id', how = 'left')
mega_table = mega_table.merge(vehicle_sample, on = 'vehicle_id', how = 'left')

In [ ]:
# check the dimensions of the mega table
mega_table.shape

(4000504, 33)

In [ ]:
sales_sample.shape

(4000504, 9)

The mega table has the same row number as the 'sales_sample' table.

In [ ]:
int(mega_table.shape[1]) == \
int(individual_sample.shape[1]) \
+ int(product.shape[1]) \
+ int(sales_sample.shape[1]) \
+ int(store.shape[1]) \
+ int(vehicle_sample.shape[1]) - 4

True

The mega table has the correct column number.

In [ ]:
mega_table.head()

,unnamed_0_x,store_id,tran_id,date,article_id,indiv_id,vehicle_id,units,sales,prod_group_code,...,msa,unnamed_0_y,email_optin_ind,ah1_res_bus_indc,supp1_bus_pander,unnamed_0,make,model,sub_model,model_year
0,1,337934,990994590,2018-07-23,7001647,318422234.0,944814728,0.0,-8.55,4.0,...,HAGERSTOWN,11239886,Y,R,N,NaN,NaN,NaN,NaN,NaN
1,2,337934,990994590,2018-07-23,7001715,318422234.0,944814728,0.0,-50.45,4.0,...,HAGERSTOWN,11239886,Y,R,N,NaN,NaN,NaN,NaN,NaN
2,3,337934,990994590,2018-07-23,7096547,318422234.0,944814728,0.0,10.00,4.0,...,HAGERSTOWN,11239886,Y,R,N,NaN,NaN,NaN,NaN,NaN
3,4,337934,990994590,2018-07-23,7001647,318422234.0,944814728,0.0,0.00,4.0,...,HAGERSTOWN,11239886,Y,R,N,NaN,NaN,NaN,NaN,NaN
4,5,337934,990994590,2018-07-23,7001715,318422234.0,944814728,0.0,0.00,4.0,...,HAGERSTOWN,11239886,Y,R,N,NaN,NaN,NaN,NaN,NaN